# PropertyLine Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PropertyLine Class
Members See Also
---
Represents kinds of PropertyLines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PropertyLine : Element
```

Visual Basic
---
```text
Public Class PropertyLine _
	Inherits Element
```

Visual C++
---
```text
public ref class PropertyLine : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..PropertyLine
# See Also
PropertyLine Members
Autodesk.Revit.DB Namespace